 onmessage = function(e) {
        var data = [];
        for (var i = 0; i < 1500; i++) {
            data[i] = [];
            for (var j = 0; j < 1500; j++) {
            data[i][j] = Math.random();
            }
        }
      postMessage(data);
}
        // worker.postMessage(); 
        // рабочий процесс начинает выполнение
        // Мы создаем рабочий процесс и указываем, к какому файлу он будет относиться. Затем мы настра­иваем перехват события message 
        // и получение сообщения (инициализиро­ванного массива) от закончившего задачу рабочего процесса. Наконец, мы запускаем рабочий процесс, 
        // отправляя пустое сообщение в postMessage():
